tests/stun-server-load-test-udp6.yml
config:
  target: "udp://127.0.0.1:3479"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
  processor: "./stun-processor.mjs"
  variables:
    socketType: "udp6"

scenarios:
  - name: "STUN Binding Request (UDP6)"
    flow:
      - function: "sendStunBindingRequest"
      - think: 1
      - function: "validateStunResponse"